OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>ADDDACER</name>
          <description>A/D RRAMP Discharge Period Register</description>
          <addressOffset>0x064</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E03</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WRION</name>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 000. The write value should be 000.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRIOFF</name>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 00. The write value should be 00.</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADHS</name>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADEXTSTR</name>
          <description>A/D Enhancing Test Register</description>
          <addressOffset>0x068</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SHTEST</name>
              <description>Test mode bit for S&amp;H circuit.Test mode bit of S&amp;H circuit only for channel.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTST</name>
              <description>Test selection bit for pressure switch.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Test non-selection </description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Pressure test mode </description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PMOS test mode </description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited (PMOS test mode)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 00. The write value should be 00.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SHTRM</name>
              <description>Current adjustment trim bit for S&amp;H circuit.Trim bit for adjustment to hardening of process.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTRM3</name>
              <description>Trim bit 3 for A/D hard macro.3bit Flash comparator power save bit for A/D hard macro to hardening of process.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTRM2</name>
              <description>Trim bit 2 for A/D hard macro.Bias adjustment trim bit for A/D hard macro to hardening of process.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTRM1</name>
              <description>Trim bit 1 for A/D hard macro.Timing adjustment trim bit for A/D hard macro to hardening of process.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADTSTRA</name>
          <description>A/D Test Register A</description>
          <addressOffset>0x06A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ATBUSSEL</name>
              <description>Analog test bus selection bit.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ATBUS use test non-selection </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ATBUS use test selection</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTSWREF</name>
              <description>Pressure switch refreshing setting bit for S&amp;H circuit amplifier test.Refreshing the pressure switch that opens for the DAC output voltage charge period when the amplifier of the S&amp;H circuit is tested only for the channel is set.</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OCSW</name>
              <description>Internal reference voltage analog switch test control bit.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal reference voltage analog switch H/W control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Internal reference voltage analog switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSSW</name>
              <description>Temperature sensor output analogue switch test control bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Temperature sensor output analogue switch H/W control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Temperature sensor output analogue switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTEST_AD</name>
              <description>Test bit for A/D analog module Bit for test of A/D analog module Details are described to the bit explanation. </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Conversion mode usually</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Self Test(VRB)</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Self Test(1/4)</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Self Test(2/4)</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Self Test(3/4)</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Self Test(VRT)</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>ADCOM input test</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Resistance DAC output test</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>ADVAL input test</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADTEST_IO</name>
              <description>Test bit for analog I/ODetails are described to the bit explanation. </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADTSTRB</name>
          <description>A/D Test Register B</description>
          <addressOffset>0x06C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADVAL</name>
              <description>Signal input bit bit14-0 for A/D analog module test.It corresponds to ADVAL 14:0 input of A/D analog module.</description>
              <lsb>0</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADTSTRC</name>
          <description>A/D Test Register C</description>
          <addressOffset>0x06E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADMD</name>
              <description>Bit for A/D analog module test.ADMODE 6:0 input of A/D analog module.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000. The write value should be 0000.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCERR</name>
              <description>Synchronous analog to digital conversion error bit.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A/D analog module and the A/D control part (soft macro part) are lights as for synchronization or 0. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Neither A/D analog module nor the A/D control part (soft macro part) have synchronized nor it is a light as for one.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 000. The write value should be 000.</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADTSTRD</name>
          <description>A/D Test Register D</description>
          <addressOffset>0x070</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADVAL16</name>
              <description>Signal input bit bit16 for A/D analog module test.It corresponds to ADVAL 16 input of A/D analog module.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
              <lsb>1</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSWTSTR0</name>
          <description>A/D Channel Switch Test Control Register 0</description>
          <addressOffset>0x072</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CHSW00</name>
              <description>Channel switch test control bit.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch00 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch00 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW01</name>
              <description>Channel switch test control bit.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch01 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch01 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW02</name>
              <description>Channel switch test control bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch02 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch02 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW03</name>
              <description>Channel switch test control bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch03 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch03 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW04</name>
              <description>Channel switch test control bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch04 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch04 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW05</name>
              <description>Channel switch test control bit.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch05 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch05 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000000. The write value should be 0000000000.</description>
              <lsb>6</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
