OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>ADSWTSTR1</name>
          <description>A/D Channel Switch Test Control Register 1</description>
          <addressOffset>0x074</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CHSW16</name>
              <description>Channel switch test control bit.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch16 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch16 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW17</name>
              <description>Channel switch test control bit.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch17 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch17 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW18</name>
              <description>Channel switch test control bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch18 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch18 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW19</name>
              <description>Channel switch test control bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch19 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch19 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW20</name>
              <description>Channel switch test control bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch20 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch20 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSW21</name>
              <description>Channel switch test control bit.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ch21 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ch21 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000000. The write value should be 0000000000.</description>
              <lsb>6</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSWTSTR2</name>
          <description>A/D Channel Switch Test Control Register 2</description>
          <addressOffset>0x076</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EX0SW</name>
              <description>Test control of 0 enhancing input channel switches bit (ANEX0 switch)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EX1SW</name>
              <description>Test control of one enhancing input channel switch bit (ANEX1 switch).</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 00. The write value should be 00.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SHBYPS0</name>
              <description>S&amp;H circuit by-pass switch control bit 0.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>S&amp;H by-pass switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>S&amp;H by-pass switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHBYPS1</name>
              <description>S&amp;H circuit by-pass switch control bit 1.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>S&amp;H by-pass switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>S&amp;H by-pass switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHBYPS2</name>
              <description>S&amp;H circuit by-pass switch control bit 2.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>S&amp;H by-pass switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>S&amp;H by-pass switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>GRP0SW</name>
              <description>Test control of 0 group switches bit.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRP1SW</name>
              <description>Test control of one group switch bit.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRP2SW</name>
              <description>Test control of two group switches bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRP3SW</name>
              <description>Test control of two group switches bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRPEX1SW</name>
              <description>Switch test control bit of enhancing analog ANEX1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enhancing analog ANEX1 switch OFF</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enhancing analog ANEX1 switch ON</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 000. The write value should be 000.</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSWCR</name>
          <description>A/D Pressure Switch Control Register</description>
          <addressOffset>0x07B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ADSWREF</name>
              <description>These bits are read as 0. The write value should be 0.Refreshing the pressure switch in A/D analog module is set. </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SHSWREF</name>
              <description>S&amp;H Boost Switch Refresh Interval Setting</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Non-Refresh</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>64 * ADCLK (Refresh Interval) / 1 * ADCLK (Refresh Period)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>32 * ADCLK (Refresh Interval) / 1 * ADCLK (Refresh Period)</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>16 * ADCLK (Refresh Interval) / 1 * ADCLK (Refresh Period)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>128 * ADCLK (Refresh Interval) / 8 * ADCLK (Refresh Period)</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>64 * ADCLK (Refresh Interval) / 8 * ADCLK (Refresh Period)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>32 * ADCLK (Refresh Interval) / 8 * ADCLK (Refresh Period)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>16 * ADCLK (Refresh Interval) / 8 * ADCLK (Refresh Period)</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADGSCS</name>
          <description>A/D Conversion Channel Status Register (for Group Scan)</description>
          <addressOffset>0x082</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x8080</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CHSELGB</name>
              <description>Channel status of Group B scan</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x80</name>
                  <description>Group B scan start </description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0xFF</name>
                  <description>Group B scan end</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSELGA</name>
              <description>Channel status of Group A scan</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x80</name>
                  <description>Group A scan start </description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0xFF</name>
                  <description>Group A scan end</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSER</name>
          <description>A/D Sampling Extension Register</description>
          <addressOffset>0x088</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000. The write value should be 0000000.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPEX</name>
              <description>Sampling extension control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not extend sampling period</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Extending sampling period</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x2</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>ADBUF%s</name>
          <description>A/D Data Buffer Register %s</description>
          <addressOffset>0x0B0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADBUF</name>
              <description>A/D data buffer registers (ADBUF) are 16-bit read-only registers that sequentially store all A/D converted values. The automatic clear function is not applied to these registers.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADBUFEN</name>
          <description>A/D Data Buffer Enable Register </description>
          <addressOffset>0x0D0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BUFEN</name>
              <description>Data Buffer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The data buffer is not used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The data buffer is used.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000. The write value should be 0000000.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
