OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>ADBUFPTR</name>
          <description>A/D Data Buffer Pointer Register</description>
          <addressOffset>0x0D2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <modifiedWriteValues>zeroToClear</modifiedWriteValues>
          <readAction>modify</readAction>
          <fields>
            <field>
              <name>BUFPTR</name>
              <description>Data Buffer PointerThese bits indicate the number of data buffer to which the next A/D converted data is transferred.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PTROVF</name>
              <description>Pointer Overflow Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The data buffer pointer has not overflowed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The data buffer pointer has overflowed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 000. The write value should be 000.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPGADBS0</name>
          <description>A/D Programmable Gain Amplifier Differential Input Bias Select Register 0</description>
          <addressOffset>0x1B4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>P0BIAS</name>
              <description>Programmable Gain Amplifiers P000 to P002 Bias Voltage SelectNOTE: This bit selects the input bias voltage value when differential inputs are used.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AVCC x 0.5</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AVCC x 0.6</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000. The write value should be 0000000.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPGADBS1</name>
          <description>A/D Programmable Gain Amplifier Differential Input Bias Select Register 1</description>
          <addressOffset>0x1B5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>P3BIAS</name>
              <description>Programmable Gain Amplifiers P003 Bias Voltage SelectNOTE: This bit selects the input bias voltage value when differential inputs are used.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AVCC x 0.5</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AVCC x 0.6</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000000. The write value should be 0000000.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADREFMON</name>
          <description>A/D External Reference Voltage Monitor Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PGAMON</name>
              <description>PGA Monitor Output Enable</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>The monitor output is disabled.</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>The monitor output is enabled.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>This bit is read as 0. The write value should be 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MONSEL</name>
              <description>Monitor output selection bit.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>No monitor output is selected.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>P000 is selected.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>P001 is selected.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>P002 is selected.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>P003 is selected.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
