OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_ADC0">
      <name>R_ADC1</name>
      <baseAddress>0x4005C200</baseAddress>
    </peripheral>
    <peripheral>
        <name>R_PSCU</name>
        <description>Peripheral Security Control Unit</description>
        <baseAddress>0x400E0000</baseAddress>
        <addressBlock>
            <offset>0x04</offset>
            <size>44</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PSARB</name>
                <description>Peripheral Security Attribution Register B</description>
                <addressOffset>0x04</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0xffffffff</resetValue>
                <resetMask>0xffffffff</resetMask>
                <fields>
                    <field>
                        <name>PSARB1</name>
                        <description>CAN1 and the MSTPCRB.MSTPB1 bit security attribution</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB2</name>
                        <description>CAN0 and the MSTPCRB.MSTPB2 bit security attribution</description>
                        <lsb>2</lsb>
                        <msb>2</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB3</name>
                        <description>CEC and the MSTPCRB.MSTPB3 bit security attribution</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB6</name>
                        <description>QSPI and the MSTPCRB.MSTPB6 bit security attribution</description>
                        <lsb>6</lsb>
                        <msb>6</msb>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB7</name>
                        <description>IIC2 and the MSTPCRB.MSTPB7 bit security attribution</description>
                        <lsb>7</lsb>
                        <msb>7</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB8</name>
                        <description>IIC1 and the MSTPCRB.MSTPB8 bit security attribution</description>
                        <lsb>8</lsb>
                        <msb>8</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB9</name>
                        <description>IIC0 and the MSTPCRB.MSTPB9 bit security attribution</description>
                        <lsb>9</lsb>
                        <msb>9</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB11</name>
                        <description>USBFS and the MSTPCRB.MSTPB11 bit security attribution</description>
                        <lsb>11</lsb>
                        <msb>11</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB12</name>
                        <description>USBHS and the MSTPCRB.MSTPB12 bit security attribution</description>
                        <lsb>12</lsb>
                        <msb>12</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB15</name>
                        <description>ETHER0/EDMAC0, the MSTPCRB.MSTPB15 bit and the PFENET.PHYMODE0 bit security attribution</description>
                        <lsb>15</lsb>
                        <msb>15</msb>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB16</name>
                        <description>OSPI and the MSTPCRB.MSTPB16 bit security attribution</description>
                        <lsb>16</lsb>
                        <msb>16</msb>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB18</name>
                        <description>RSPI1 and the MSTPCRB.MSTPB18 bit security attribution</description>
                        <lsb>18</lsb>
                        <msb>18</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB19</name>
                        <description>RSPI0 and the MSTPCRB.MSTPB19 bit security attribution</description>
                        <lsb>19</lsb>
                        <msb>19</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB22</name>
                        <description>SCI9 and the MSTPCRB.MSTPB22 bit security attribution</description>
                        <lsb>22</lsb>
                        <msb>22</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB23</name>
                        <description>SCI8 and the MSTPCRB.MSTPB23 bit security attribution</description>
                        <lsb>23</lsb>
                        <msb>23</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB24</name>
                        <description>SCI7 and the MSTPCRB.MSTPB24 bit security attribution</description>
                        <lsb>24</lsb>
                        <msb>24</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB25</name>
                        <description>SCI6 and the MSTPCRB.MSTPB25 bit security attribution</description>
                        <lsb>25</lsb>
                        <msb>25</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB26</name>
                        <description>SCI5 and the MSTPCRB.MSTPB26 bit security attribution</description>
                        <lsb>26</lsb>
                        <msb>26</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB27</name>
                        <description>SCI4 and the MSTPCRB.MSTPB27 bit security attribution</description>
                        <lsb>27</lsb>
                        <msb>27</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB28</name>
                        <description>SCI3 and the MSTPCRB.MSTPB28 bit security attribution</description>
                        <lsb>28</lsb>
                        <msb>28</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB29</name>
                        <description>SCI2 and the MSTPCRB.MSTPB29 bit security attribution</description>
                        <lsb>29</lsb>
                        <msb>29</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB30</name>
                        <description>SCI1 and the MSTPCRB.MSTPB30 bit security attribution</description>
                        <lsb>30</lsb>
                        <msb>30</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARB31</name>
                        <description>SCI0 and the MSTPCRB.MSTPB31 bit security attribution</description>
                        <lsb>31</lsb>
                        <msb>31</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
