OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
            <register>
                <name>PSARE</name>
                <description>Peripheral Security Attribution Register E</description>
                <addressOffset>0x10</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0xffffffff</resetValue>
                <resetMask>0xffffffff</resetMask>
                <fields>
                    <field>
                        <name>PSARE0</name>
                        <description>WDT security attribution</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE1</name>
                        <description>IWDT security attribution</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE2</name>
                        <description>RTC security attribution</description>
                        <lsb>2</lsb>
                        <msb>2</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE14</name>
                        <description>AGT5 and the MSTPCRE.MSTPE14 bit security attribution</description>
                        <lsb>14</lsb>
                        <msb>14</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE15</name>
                        <description>AGT4 and the MSTPCRE.MSTPE15 bit security attribution</description>
                        <lsb>15</lsb>
                        <msb>15</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE22</name>
                        <description>GPT9 and the MSTPCRE.MSTPE22 bit security attribution</description>
                        <lsb>22</lsb>
                        <msb>22</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE23</name>
                        <description>GPT8 and the MSTPCRE.MSTPE23 bit security attribution</description>
                        <lsb>23</lsb>
                        <msb>23</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE24</name>
                        <description>GPT7 and the MSTPCRE.MSTPE24 bit security attribution</description>
                        <lsb>24</lsb>
                        <msb>24</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE25</name>
                        <description>GPT6 and the MSTPCRE.MSTPE25 bit security attribution</description>
                        <lsb>25</lsb>
                        <msb>25</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE26</name>
                        <description>GPT5 and the MSTPCRE.MSTPE26 bit security attribution</description>
                        <lsb>26</lsb>
                        <msb>26</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE27</name>
                        <description>GPT4 and the MSTPCRE.MSTPE27 bit security attribution</description>
                        <lsb>27</lsb>
                        <msb>27</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE28</name>
                        <description>GPT3 and the MSTPCRE.MSTPE28 bit security attribution</description>
                        <lsb>28</lsb>
                        <msb>28</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE29</name>
                        <description>GPT2 and the MSTPCRE.MSTPE29 bit security attribution</description>
                        <lsb>29</lsb>
                        <msb>29</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE30</name>
                        <description>GPT1 and the MSTPCRE.MSTPE30 bit security attribution</description>
                        <lsb>30</lsb>
                        <msb>30</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARE31</name>
                        <description>GPT0 and the MSTPCRE.MSTPE31 bit security attribution</description>
                        <lsb>31</lsb>
                        <msb>31</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>MSSAR</name>
                <description>Module Stop Security Attribution Register</description>
                <addressOffset>0x14</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0xffffffff</resetValue>
                <resetMask>0xffffffff</resetMask>
                <fields>
                    <field>
                        <name>MSSAR0</name>
                        <description>The MSTPCRC.MSTPC14 bit security attribution</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MSSAR1</name>
                        <description>The MSTPCRA.MSTPA22 bit security attribution</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MSSAR2</name>
                        <description>The MSTPCRA.MSTPA7 bit security attribution</description>
                        <lsb>2</lsb>
                        <msb>2</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MSSAR3</name>
                        <description>The MSTPCRA.MSTPA0 bit security attribution</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CFSAMONA</name>
                <description>Code Flash Security Attribution Monitor Register A</description>
                <addressOffset>0x18</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <fields>
                    <field>
                        <name>CFS1</name>
                        <description>Code Flash Secure area 1</description>
                        <lsb>15</lsb>
                        <msb>23</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CFSAMONB</name>
                <description>Code Flash Security Attribution Monitor Register B</description>
                <addressOffset>0x1C</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <fields>
                    <field>
                        <name>CFS2</name>
                        <description>Code Flash Secure area 2</description>
                        <lsb>10</lsb>
                        <msb>23</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DFSAMON</name>
                <description>Data Flash Security Attribution Monitor Register</description>
                <addressOffset>0x20</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <fields>
                    <field>
                        <name>DFS</name>
                        <description>Data flash Secure area</description>
                        <lsb>10</lsb>
                        <msb>15</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSAMONA</name>
                <description>SRAM Security Attribution Monitor Register A</description>
                <addressOffset>0x24</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <fields>
                    <field>
                        <name>SS1</name>
                        <description>SRAM Secure area 1</description>
                        <lsb>13</lsb>
                        <msb>20</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSAMONB</name>
                <description>SRAM Security Attribution Monitor Register B</description>
                <addressOffset>0x28</addressOffset>
                <size>32</size>
                <access>read-only</access>
                <fields>
                    <field>
                        <name>SS2</name>
                        <description>SRAM secure area 2</description>
                        <lsb>10</lsb>
                        <msb>20</msb>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
