OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>SDIR</name>
            <description>SDRAM Initialization Register</description>
            <addressOffset>0x24</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0010</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PRC</name>
                <description>Initialization Precharge Cycle Count   ( PRF+3 cycles )</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>ARFC</name>
                <description>Initialization Auto-Refresh Count</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>Setting prohibited</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>ARFC+1 times</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARFI</name>
                <description>Initialization Auto-Refresh Interval ( PRF+3 cycles )</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SDADR</name>
            <description>SDRAM Address Register</description>
            <addressOffset>0x40</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>MXC</name>
                <description>Address Multiplex Select</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>8-bit shift</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>9-bit shift</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>10-bit shift</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>11-bit shift</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDTR</name>
            <description>SDRAM Timing Register</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RAS</name>
                <description>Row Active Interval</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>000</name>
                    <description>1 cycle</description>
                    <value>#000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>2 cycles</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>3 cycles</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>4 cycles</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>5 cycles</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>6 cycles</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>7 cycles</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>111</name>
                    <description>Setting prohibited</description>
                    <value>#111</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RCD</name>
                <description>Row Column Latency ( RCD+1  cycles )</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>RP</name>
                <description>Row Precharge Interval ( RP+1  cycles )</description>
                <lsb>9</lsb>
                <msb>11</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>WR</name>
                <description>Write Recovery Interval</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>1 cycle</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>2 cycles</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CL</name>
                <description>SDRAMC Column Latency</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>001</name>
                    <description>1 cycle</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>2 cycles</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>3 cycles</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDMOD</name>
            <description>SDRAM Mode Register</description>
            <addressOffset>0x48</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MR</name>
                <description>Mode Register SettingWriting to these bits: Mode register set command is issued.</description>
                <lsb>0</lsb>
                <msb>14</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SDSR</name>
            <description>SDRAM Status Register</description>
            <addressOffset>0x50</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>SRFST</name>
                <description>Self-Refresh Transition/Recovery Status</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Transition/recovery not in progress</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Transition/recovery in progress</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INIST</name>
                <description>Initialization Status</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Initialization sequence not in progress</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Initialization sequence in progress</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MRSST</name>
                <description>Mode Register Setting Status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Mode register setting not in progress</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Mode register setting in progress</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>11</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>BUS1</name>
              <description>BUS1</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS2</name>
              <description>BUS2</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS3</name>
              <description>BUS3</description>
              <value>2</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS4</name>
              <description>BUS4</description>
              <value>3</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS5</name>
              <description>BUS5</description>
              <value>4</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS6</name>
              <description>BUS6</description>
              <value>5</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS7</name>
              <description>BUS7</description>
              <value>6</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS8</name>
              <description>BUS8</description>
              <value>7</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS9</name>
              <description>BUS9</description>
              <value>8</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS10</name>
              <description>BUS10</description>
              <value>9</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>BUS11</name>
              <description>BUS11</description>
              <value>10</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>BUSERR[%s]</name>
          <description>Bus Error Registers</description>
          <addressOffset>0x1800</addressOffset>
          <register>
            <name>ADD</name>
            <description>Bus Error Address Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>BERAD</name>
                <description>Bus Error AddressWhen a bus error occurs, It stores an error address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STAT</name>
            <description>Bus Error Status Register</description>
            <addressOffset>0x04</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0xFE</resetMask>
            <fields>
              <field>
                <name>ERRSTAT</name>
                <description>Bus Error StatusWhen bus error assert, error flag occurs.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No bus error occurred</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Bus error occurred</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACCSTAT</name>
                <description>Error access statusThe status at the time of the error</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Read access</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Write Access</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>M4I</name>
              <description>M4I</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>M4D</name>
              <description>M4D</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>SYS</name>
              <description>SYS</description>
              <value>2</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DMA</name>
              <description>DMA</description>
              <value>3</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>EDM</name>
              <description>EDM</description>
              <value>4</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPX</name>
              <description>GPX</description>
              <value>5</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>BUSM[%s]</name>
          <description>Master Bus Control Register Array</description>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>CNT</name>
            <description>Master Bus Control Register </description>
            <addressOffset>0x0</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IERES</name>
                <description>Ignore Error Responses</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Bus error will be reported.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will not be reported.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>FLI</name>
              <description>FLI</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>RAMH</name>
              <description>RAMH</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>MBIU</name>
              <description>MBIU</description>
              <value>2</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>RAM0</name>
              <description>RAM0</description>
              <value>3</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>RAM1</name>
              <description>RAM1</description>
              <value>4</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P0B</name>
              <description>P0B</description>
              <value>5</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P2B</name>
              <description>P2B</description>
              <value>6</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P3B</name>
              <description>P3B</description>
              <value>7</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P4B</name>
              <description>P4B</description>
              <value>8</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>PxB</name>
              <description>PxB</description>
              <value>9</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P6B</name>
              <description>P6B</description>
              <value>10</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P7B</name>
              <description>P7B</description>
              <value>11</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>FBU</name>
              <description>FBU</description>
              <value>12</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>EXT</name>
              <description>EXT</description>
              <value>13</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>EXT2</name>
              <description>EXT2</description>
              <value>14</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPX</name>
              <description>GPX</description>
              <value>15</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>BUSS[%s]</name>
          <description>Slave Bus Control Register Array</description>
          <addressOffset>0x1100</addressOffset>
          <register>
            <name>CNT</name>
            <description>Slave Bus Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ARBMET</name>
                <description>Arbitration MethodSpecify the priority between groups</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>fixed priority</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>round-robin</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
