OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_CAN0</name>
      <description>Controller Area Network (CAN) Module</description>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0x00000200</offset>
        <size>0x230</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000820</offset>
        <size>0x039</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>MB[%s]</name>
          <description>Mailbox</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>ID</name>
            <description>Mailbox ID Register </description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>IDE</name>
                <description>ID Extension</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Standard ID</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Extended ID</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTR</name>
                <description>Remote Transmission Request</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Data frame</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Remote frame</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SID</name>
                <description>Standard ID </description>
                <lsb>18</lsb>
                <msb>28</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>EID</name>
                <description>Extended ID</description>
                <lsb>0</lsb>
                <msb>17</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DL</name>
            <description>Mailbox DLC Register </description>
            <addressOffset>0x4</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0x0000</resetMask>
            <fields>
              <field>
                <name>DLC</name>
                <description>Data Length Code</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0000</name>
                    <description>Data length = 0 byte</description>
                    <value>#0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0001</name>
                    <description>Data length = 1 byte</description>
                    <value>#0001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0010</name>
                    <description>Data length = 2 bytes</description>
                    <value>#0010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0011</name>
                    <description>Data length = 3 bytes</description>
                    <value>#0011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0100</name>
                    <description>Data length = 4 bytes</description>
                    <value>#0100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0101</name>
                    <description>Data length = 5 bytes</description>
                    <value>#0101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0110</name>
                    <description>Data length = 6 bytes</description>
                    <value>#0110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0111</name>
                    <description>Data length = 7 bytes</description>
                    <value>#0111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Data length = 8 bytes</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x01</dimIncrement>
            <name>D[%s]</name>
            <description>Mailbox Data Register </description>
            <addressOffset>0x6</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>DATA0 to DATA7 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB-first, and transmission or reception starts from bit 7</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TS</name>
            <description>Mailbox Timestamp Register </description>
            <addressOffset>0xE</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0x0000</resetMask>
            <fields>
              <field>
                <name>TSH</name>
                <description>Time Stamp Lower ByteBits TSH[7:0] store the counter value of the time stamp when received messages are stored in the mailbox.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>TSL</name>
                <description>Time Stamp Higher ByteBits TSL[7:0] store the counter value of the time stamp when received messages are stored in the mailbox.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MKR[%s]</name>
          <description>Mask Register </description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SID</name>
              <description>Standard ID </description>
              <lsb>18</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EID</name>
              <description>Extended ID</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FIDCR[%s]</name>
          <description>FIFO Received ID Compare Registers </description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>IDE</name>
              <description>ID Extension</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Standard ID</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Extended ID</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTR</name>
              <description>Remote Transmission Request</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data frame</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Remote frame</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SID</name>
              <description>Standard ID </description>
              <lsb>18</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EID</name>
              <description>Extended ID</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
