OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>CTSUMCH</name>
          <description>CTSU Measurement Channel Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00003f3f</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MCH0</name>
              <description>CTSU Measurement Channel 0</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>TS00</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>TS02</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>TS04</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>TS05</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>TS06</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>TS07</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>TS08</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>TS09</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>TS10</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>TS11</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>TS12</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>TS13</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>TS14</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>TS15</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>TS16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>TS17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>TS18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>TS21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>TS22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>TS23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>TS24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>TS25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>TS26</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>TS27</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1C</name>
                  <description>TS28</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1D</name>
                  <description>TS29</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>TS30</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>TS31</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>TS32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>TS33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x22</name>
                  <description>TS34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x23</name>
                  <description>TS35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3F</name>
                  <description>Measurement is being stopped.</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCH1</name>
              <description>CTSU Measurement Channel 1</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>TS00</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>TS02</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>TS04</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>TS05</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>TS06</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>TS07</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>TS08</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>TS09</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>TS10</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>TS11</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>TS12</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>TS13</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>TS14</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>TS15</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>TS16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>TS17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>TS18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>TS21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>TS22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>TS23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>TS24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>TS25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>TS26</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>TS27</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1C</name>
                  <description>TS28</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1D</name>
                  <description>TS29</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>TS30</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>TS31</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>TS32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>TS33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x22</name>
                  <description>TS34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x23</name>
                  <description>TS35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3F</name>
                  <description>Measurement is being stopped.</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA0</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA1</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA2</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCA3</name>
              <description>CTSU Multiple Valid Clock Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Valid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invalid</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUMCHL</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUMCH0</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUMCH1</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUMCHH</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCH</alternateRegister>
          <addressOffset>0x0A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3f3f</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUMFAF</name>
          <description>CTSU Measurement Channel Register</description>
          <alternateRegister>CTSUMCHH</alternateRegister>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3f</resetValue>
          <resetMask>0xff</resetMask>
        </register>
