OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_DEBUG</name>
      <description>Debug Function</description>
      <baseAddress>0x4001B000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DBGSTR</name>
          <description>Debug Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDBGPWRUPREQ</name>
              <description>Debug power-up request</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0: OCD is not requesting debug power up</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>0: OCD is requesting debug power up</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDBGPWRUPACK</name>
              <description>Debug power-up acknowledge</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Debug power-up request is not acknowledged</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Debug power-up request is acknowledged</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGSTOPCR</name>
          <description>Debug Stop Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBGSTOP_RPER</name>
              <description>Mask bit for SRAM parity error</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <dim>3</dim>
              <dimIncrement>1</dimIncrement>
              <name>DBGSTOP_LVD%s</name>
              <description>Mask bit for LVD reset/interupt</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enable reset/interupt on corresponding LVD</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Mask reset/interupt on corresponding LVD</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGSTOP_RECCR</name>
              <description>Mask bit for SRAM ECC error</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>DBGSTOP_IWDT</name>
              <description>Mask bit for IWDT reset/interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>DBGSTOP_WDT</name>
              <description>Mask bit for WDT reset/interrupt </description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DBGSTOP_CPER</name>
              <description>Mask bit for Cache SRAM parity error reset/interrupt</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enable Cache SRAM parity error reset/interrupt</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Mask Cache SRAM parity error reset/interrupt</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_DMA</name>
      <description>DMA Controller Common</description>
      <baseAddress>0x40005200</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMAST</name>
          <description>DMAC Module Activation Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DMST</name>
              <description>DMAC Operation Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMECHR</name>
          <description>DMAC Error Channel Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DMECH</name>
              <description>DMAC Error channel</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMECHSAM</name>
              <description>DMAC Error channel Security Attribution Monitor</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>secure channel</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>non-secure channel</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMESTA</name>
              <description>DMAC Error Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No DMA transfer error occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA transfer error occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
