OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ELC</name>
      <description>Event Link Controller</description>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000002</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000014</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000020</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000024</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000002C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000030</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000034</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000038</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000003C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000044</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000048</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000004C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000054</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000058</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000005C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000060</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000064</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000068</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>ELSEGR[%s]</name>
          <description>Event Link Software Event Generation Register</description>
          <addressOffset>0x02</addressOffset>
          <register>
            <name>BY</name>
            <description>Event Link Software Event Generation Register</description>
            <addressOffset>0x00</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x80</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>WI</name>
                <description>ELSEGR Register Write Disable</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Write to ELSEGR register is enabled.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Write to ELSEGR register is disabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WE</name>
                <description>SEG Bit Write Enable</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Write to SEG bit is disabled.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Write to SEG bit is enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEG</name>
                <description>Software Event Generation</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Normal operation</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Software event is generated.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>23</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>GPTA</name>
              <description>GPTA</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTB</name>
              <description>GPTB</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTC</name>
              <description>GPTC</description>
              <value>2</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTD</name>
              <description>GPTD</description>
              <value>3</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTE</name>
              <description>GPTE</description>
              <value>4</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTF</name>
              <description>GPTF</description>
              <value>5</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTG</name>
              <description>GPTG</description>
              <value>6</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>GPTH</name>
              <description>GPTH</description>
              <value>7</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>ADCA0</name>
              <description>ADCA0</description>
              <value>8</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>ADCB0</name>
              <description>ADCB0</description>
              <value>9</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>ADCA1</name>
              <description>ADCA1</description>
              <value>10</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>ADCB1</name>
              <description>ADCB1</description>
              <value>11</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DA0</name>
              <description>DA0</description>
              <value>12</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DA1</name>
              <description>DA1</description>
              <value>13</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>PORT1</name>
              <description>PORT1</description>
              <value>14</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>PORT2</name>
              <description>PORT2</description>
              <value>15</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>PORT3</name>
              <description>PORT3</description>
              <value>16</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>PORT4</name>
              <description>PORT4</description>
              <value>17</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>CTSU</name>
              <description>CTSU</description>
              <value>18</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DA80</name>
              <description>DA80</description>
              <value>19</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DA81</name>
              <description>DA81</description>
              <value>20</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>DA82</name>
              <description>DA82</description>
              <value>21</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>SDADC0</name>
              <description>SDADC0</description>
              <value>22</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>ELSR[%s]</name>
          <description>Event Link Setting Register %s</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>HA</name>
            <description>Event Link Setting Register</description>
            <addressOffset>0x00</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ELS</name>
                <description>Event Link Select</description>
                <lsb>0</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x000</name>
                    <description>Event output to the corresponding peripheral module is disabled.</description>
                    <value>0x000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Set the number for the event signal to be linked.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>ELCR</name>
          <description>Event Link Controller Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ELCON</name>
              <description>All Event Link Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ELC function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ELC function is  enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ELCSARA</name>
          <description>Event Link Controller Security Attribution Register A</description>
          <addressOffset>0x74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ELSEGR0</name>
              <description>Event Link Software Event Generation Register 0 Security Attribution</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>NonSecure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELSEGR1</name>
              <description>Event Link Software Event Generation Register 1Security Attribution</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>NonSecure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELCR</name>
              <description>Event Link Controller RegisterSecurity Attribution</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>NonSecure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 1111111111111. The write value should be 1111111111111.</description>
              <lsb>3</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
