OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ETHERC0</name>
      <description>Ethernet MAC Controller</description>
      <baseAddress>0x40064100</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000020</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000060</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C0</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C8</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D0</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000E4</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ECMR</name>
          <description>ETHERC Mode Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPC</name>
              <description>PAUSE Frame Transmit</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PAUSE frame is transmitted even during a PAUSE period.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PAUSE frame is not transmitted during a PAUSE period.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZPF</name>
              <description>0 Time PAUSE Frame Enable</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PAUSE frame that contains the pause_time parameter of 0 is not used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PAUSE frame that contains the pause_time parameter of 0 is used.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFR</name>
              <description>PAUSE Frame Receive Mode</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PAUSE frame is not transferred to the EDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PAUSE frame is transferred to the EDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXF</name>
              <description>Receive Flow Control Operating Mode</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PAUSE frame detection is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PAUSE frame detection is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXF</name>
              <description>Transmit Flow Control Operating Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Automatic PAUSE frame transmission is disabled.(PAUSE frame is not automatically transmitted.)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Automatic PAUSE frame transmission is enabled.(PAUSE frame is automatically transmitted as required.)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRCEF</name>
              <description>CRC Error Frame Receive Mode</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>EDMAC is notified of a CRC error.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>EDMAC is not notified of a CRC error.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPDE</name>
              <description>Magic Packet Detection Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Magic Packet detection is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Magic Packet detection is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RE</name>
              <description>Reception Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Receive function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Receive function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmission Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Transmit function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmit function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILB</name>
              <description>Internal Loopback Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal data transmission or reception is performed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data is looped back in the ETHERC when full-duplex mode is selected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTM</name>
              <description>Bit Rate</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>10 Mbps</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>100 Mbps</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Half-duplex mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Full-duplex mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRM</name>
              <description>Promiscuous Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Promiscuous mode is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Promiscuous mode is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFLR</name>
          <description>Receive Frame Maximum Length Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFL</name>
              <description>Receive Frame Maximum LengthThe set value becomes the maximum frame length. The minimum value that can be set is 1,518 bytes, and the maximum value that can be set is 2,048 bytes. Values that are less than 1,518 bytes are regarded as 1,518 bytes, and values larger than 2,048 bytes are regarded as 2,048 bytes.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSR</name>
          <description>ETHERC Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BFR</name>
              <description>Continuous Broadcast Frame Reception Flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Continuous reception of broadcast frames has not been detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Continuous reception of broadcast frames has been detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSRTO</name>
              <description>PAUSE Frame Retransmit Over Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PAUSE frame retransmit count has not reached the upper limit.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PAUSE frame retransmit count has reached the upper limit.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCHNG</name>
              <description>LCHNG Link Signal Change Flag</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Change in the ETn_LINKSTA signal has not been detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Change in the ETn_LINKSTA signal has been detected (high to low, or low to high).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPD</name>
              <description>Magic Packet Detect Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Magic Packet has not been detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Magic Packet has been detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICD</name>
              <description>False Carrier Detect Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PHY-LSI has not detected a false carrier on the line.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PHY-LSI has detected a false carrier on the line.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSIPR</name>
          <description>ETHERC Interrupt Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BFSIPR</name>
              <description>Continuous Broadcast Frame Reception Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Notification of continuous broadcast frame reception interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Notification of continuous broadcast frame reception interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSRTOIP</name>
              <description>PAUSE Frame Retransmit Over Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Notification of PAUSE frame retransmit over interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Notification of PAUSE frame retransmit over interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCHNGIP</name>
              <description>LINK Signal Change Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Notification of ETn_LINKSTA signal change interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Notification of ETn_LINKSTA signal change interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPDIP</name>
              <description>Magic Packet Detect Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Notification of the Magic Packet detect interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Notification of the Magic Packet detect interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICDIP</name>
              <description>False Carrier Detect Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Notification of the false carrier detect interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Notification of the false carrier detect interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
