OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_ETHERC_EPTPC">
      <name>R_ETHERC_EPTPC1</name>
      <baseAddress>0x40065C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_ETHERC_EPTPC_CFG</name>
      <description>Ethernet PTP Configuration</description>
      <baseAddress>0x40064500</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTRSTR</name>
          <description>EPTPC Reset Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESET</name>
              <description>EPTPC Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not reset the EPTPC</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reset the EPTPC. Do not access the EPTPC-related registers other than this register while a software reset is being issued.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STCSELR</name>
          <description>STCA Clock Select Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCLKSEL</name>
              <description>STCA Clock Select</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>PCLKA clock divided by 1 to 6</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Input clock from the REF50CK0 pin</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Input clock from the REF50CK1 pin</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings other than above are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLKDIV</name>
              <description>PCLKA Clock Frequency Division</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>001</name>
                  <description>1</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>1/2</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>1/3</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1/4</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1/5</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1/6</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings other than above are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASS</name>
          <description>Bypass 1588 module Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS1</name>
              <description>Bypass 1588 module for Ether 1ch</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>to use 1588 module for Ether 1ch</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>to bypass 1588 module for Ether 1ch</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS0</name>
              <description>Bypass 1588 module for Ether 0ch </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>to use 1588 module for Ether 0ch</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>to bypass 1588 module for Ether 0ch</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
