OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_FACI_HP_CMD</name>
      <description>Flash Application Command Interface Command-Issuing Area</description>
      <baseAddress>0x407E0000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FACI_CMD16</name>
          <description>FACI Command Issuing Area (halfword access)</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>FACI_CMD8</name>
          <description>FACI Command Issuing Area (halfword access)</description>
          <alternateRegister>FACI_CMD16</alternateRegister>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_FACI_HP</name>
      <description>Flash Application Command Interface</description>
      <baseAddress>0x407FE000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FASTAT</name>
          <description>Flash Access Status</description>
          <addressOffset>0x0010</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CFAE</name>
              <description>Code Flash Access Error</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No code flash access error has occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Code flash access error has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDLK</name>
              <description>Command Lock</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DFAE</name>
              <description>Data Flash Access Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>ECRCT</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAEINT</name>
          <description>Flash Access Error Interrupt Enable</description>
          <addressOffset>0x0014</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x99</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CFAEIE</name>
              <description>Code Flash Access Error Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not generate "intflerr" interrupt request when CFAE = "1".</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generates "intflerr" interrupt request when CFAE = "1".</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDLKIE</name>
              <description>Command Lock Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not generate "intflerr" interrupt request when CMDLK = "1".</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generates "intflerr" interrupt request when CMDLK = "1".</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFAEIE</name>
              <description>Data Flash Access Error Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not generate "intflerr" interrupt request when DFAE = "1".</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generates "intflerr" interrupt request when DFAE = "1".</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECRCTIE</name>
              <description>Error Correct Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not generate "intflerr" interrupt request when ECRCT = "1".</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generates "intflerr" interrupt request when ECRCT = "1".</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRDYIE</name>
          <description>Flash Ready Interrupt Enable</description>
          <addressOffset>0x0018</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>FRDYIE</name>
              <description>FRDY Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not generate "intflend" interrupt request when FRDY is changed from "0" to "1".</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generates "intflend" interrupt request when FRDY is changed from "0" to "1".</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSADDR</name>
          <description>Flash Start Address</description>
          <addressOffset>0x0030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSA</name>
              <description>Start Address of Flash Sequencer Command Target Area
  These bits can be written when FRDY bit of FSTATR register is "1". Writing to these bits in FRDY = "0" is ignored.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>others</name>
                  <description>Specifies start address for each command processing.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FEADDR</name>
          <description>Flash End Address</description>
          <addressOffset>0x0034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEA</name>
              <description>End Address of Flash Sequencer Command Target Area
  Specifies end address of target area in "Blank Check" command.
  These bits can be written when FRDY bit of FSTATR register is "1". Writing to these bits in FRDY = "0" is ignored.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMEPROT</name>
          <description>Flash P/E Mode Entry Protection Register</description>
          <addressOffset>0x0044</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY Code</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0xD9</name>
                  <description>Writing to the other bits in this register is enabled.</description>
                  <value>0xD9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the other bits in this register is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPROT</name>
              <description>Code Flash P/E Mode Entry Protection
Writing to this bit is only possible when the FRDY bit in the FSTATR register is 1. Writing to this bit while the FRDY bit = 0 is
ignored.
Writing to this bit is only possible when 16 bits are written and the value written to the KEY bits is D9h.
Written values are not retained by these bits (always read as 0x00).
Only secure access can write to this register. Both secure access and non-secure read access are allowed. Non-secure write
access is denied, but TrustZone access error is note generated.
              </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FENTRYC bit is not protected</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FENTRYC bit is protected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FBPROT0</name>
          <description>Flash Block Protection Register</description>
          <addressOffset>0x0078</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY Code</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x78</name>
                  <description>Writing to the other bits in this register is enabled.</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the other bits in this register is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BPCN0</name>
              <description>Block Protection for Non-secure Cancel
This bit can be written when the FRDY bit in the FSTATR register is 1. Writing to this bit is ignored when the FRDY bit is 0.
Writing to this bit is only possible when 16 bits are written and the value written to the KEY[7:0] bits is 0x78.
Written values are not retained by these bits (always read as 0x00).
              </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FENTRYC bit is not protected</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FENTRYC bit is protected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FBPROT1</name>
          <description>Flash Block Protection for Secure Register</description>
          <addressOffset>0x007C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY Code</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0xB1</name>
                  <description>Writing to the other bits in this register is enabled.</description>
                  <value>0xB1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the other bits in this register is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BPCN1</name>
              <description>Block Protection for Secure Cancel
Writing to this bit is only possible when the FRDY bit in the FSTATR register is 1. Writing to this bit while FRDY bit = 0 is ignored.
Writing to this bit is only possible when 16 bits are written and the value written to the KEY[7:0] bits is 0xB1.
Written values are not retained by these bits (always read as 0x00).
              </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FENTRYC bit is not protected</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FENTRYC bit is protected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
