OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_GLCDC</name>
      <description>Graphics LCD Controller</description>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x101C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001100</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001118</offset>
        <size>0x02C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000114C</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001200</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001218</offset>
        <size>0x02C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000124C</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001300</offset>
        <size>0x03C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001340</offset>
        <size>0x03C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001380</offset>
        <size>0x03C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000013C0</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000013E4</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001404</offset>
        <size>0x028</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00001440</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <name>BG</name>
          <description>Background Registers</description>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>EN</name>
            <description>Background Plane Setting Operation Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWRST</name>
                <description>Entire module SW reset control</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Releases the entire module from the SW reset state.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Places the entire module in the SW reset state.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VEN</name>
                <description>Control of LCDC internal register value reflection to internal operations</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables(Cleared to 0 by an internal source)</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Background plane generation module operation enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables operation.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables operation.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PERI</name>
            <description>Background Plane Setting Free-Running Period Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00170017</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FV</name>
                <description>Background plane vertical synchronization signal period on the basis of line.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x013</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FV</name>
                    <description>FV lines.The valid range is 0x013 to 0x3FF.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FH</name>
                <description>Background plane horizontal synchronization signal period on the basis of pixel clock (PXCLK).</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x017</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FH</name>
                    <description>FH lines. The valid range is 0x017 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYNC</name>
            <description>Background Plane Setting Synchronization Position Register</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00010001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VP</name>
                <description>Background plane vertical synchronization signal assertion position on the basis of line.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>Setting prohibited</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>(VP)th line</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HP</name>
                <description>Background plane horizontal synchronization signal assertion position on the basis of pixel clock (PXCLK).</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0x0</name>
                    <description>Setting prohibited</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>(HP)th line (pixels)</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VSIZE</name>
            <description>Background Plane Setting Full Image Vertical Size Register</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00070010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VP</name>
                <description>Background plane vertical valid pixel start position on the basis of line</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x0003</minimum>
                    <maximum>0x3EF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VP</name>
                    <description>VP lines. The valid range is 0x003 to 0x3EF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VW</name>
                <description>Background plane vertical valid pixel width on the basis of line </description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x0010</minimum>
                    <maximum>0x03FC</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VW</name>
                    <description>VW lines. The valid range is 0x010 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HSIZE</name>
            <description>Background Plane Setting Full Image Horizontal Size Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00060010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HP</name>
                <description>Background plane horizontal valid pixel start position on the basis of pixel clock (PXCLK).</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x006</minimum>
                    <maximum>0x3EE</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HP</name>
                    <description>HP cycle(pixel). The valid range is 0x006 to 0x3EE. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HW</name>
                <description>
									Background plane horizontall valid pixel width on the basis of pixel clock (PXCLK)
									Note: When serial RGB is selected as the output format for the output control block, add two to the horizontal enable signal width and set the resulting value to this field.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x010</minimum>
                    <maximum>0x3F8</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HW</name>
                    <description>HW cycles. The valid range is 0x010 to 0x3F8. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BGC</name>
            <description>Background Plane Setting Background Color Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>R</name>
                <description>
									R value for background plane valid pixel area.
									Unsigned; 8-bit integer.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>G</name>
                <description>
									G value for background plane valid pixel area
									Unsigned; 8-bit integer
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>B</name>
                <description>
									B value for background plane valid pixel area
									Unsigned; 8-bit integer
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MON</name>
            <description>Background Plane Setting Status Monitor Register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWRST</name>
                <description>Entire module SW reset state monitor.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>The entire module is released from the SW reset state.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>The entire module is in the SW reset state.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VEN</name>
                <description>
									Entire module internal operation reflection control signal monitor.
									The signal  state for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal.
								</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is asserted.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is negated.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Background plane generation module operation state monitor.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Operation is in progress.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Operation is stopped.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>GR[%s]</name>
          <description>Layer Registers</description>
          <addressOffset>0x1100</addressOffset>
          <register>
            <name>VEN</name>
            <description>Graphics Register Update Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PVEN</name>
                <description>
									Control of graphics n module register value reflection to internal operations.
									Reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLMRD</name>
            <description>Graphics Frame Buffer Read Control Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RENB</name>
                <description>Graphics data (frame buffer data) read enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables reading.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables reading.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM1</name>
            <description>Graphics Frame Buffer Control Register 1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BSTMD</name>
                <description>
									Burst transfer control for graphics data (frame buffer data)
									access
								</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>16-beat increment burst transfer (64-byte boundary)</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM2</name>
            <description>Graphics Frame Buffer Control Register 2</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASE</name>
                <description>
									Base address for accessing graphics data (frame buffer data)
									Set the head address in the frame buffer where graphics data is to be stored. GRn_FLM2.BASE[5:0] should be fixed to 0 during 64-byte burst transfer.
								</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
