OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>FLM3</name>
            <description>Graphics Frame Buffer Control Register 3</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LNOFF</name>
                <description>
									Macro line offset address for accessing graphics data
									(frame buffer data)
									Signed; 16-bit integer
								</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM5</name>
            <description>Graphics Frame Buffer Control Register 5</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LNNUM</name>
                <description>Number of lines per frame for accessing graphics data (frame buffer data).</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x00F</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LNNUM</name>
                    <description>LNNUM lines.  The valid range is 0x00F to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATANUM</name>
                <description>Number of data transfer times per line for accessing graphics data (frame buffer data), where one transfer is defined as 16-beat burst access (64-byte boundary)</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DATAUM</name>
                    <description>DATAUM+1 times.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM6</name>
            <description>Graphics Frame Buffer Control Register 6</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FORMAT</name>
                <description>Data format for accessing graphics data (frame buffer data).</description>
                <lsb>28</lsb>
                <msb>30</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>CLUT11bit/pix)</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>CLUT4 (4 bits/pix)</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>CLUT8 (8 bits/pix)</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>ARGB8888 (32 bits/pix)</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>ARGB4444 (16 bits/pix)</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>ARGB1555 (16 bits/pix, 1 bit of A is LUT data)</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>RGB888 (32 bits/pix, 8 bits on the MSB side are invalid)</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>RGB565 (16 bits/pix)</description>
                    <value>#000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB1</name>
            <description>Graphics Alpha Blending Control Register 1</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCON</name>
                <description>Rectangular area alpha blending control.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>On</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCDISPON</name>
                <description>Image area border display control for rectangular area alpha blending.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Display on</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Display off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCDISPON</name>
                <description>Graphics image area border display control.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Display on</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Display off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISPSEL</name>
                <description>Graphics display plane control.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Blended display of lower-layer graphics (input image from the previous stage) and current graphics (graphics data read from the AHB bus)</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Current graphics display</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Lower-layer graphics display</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Background color display (value set by the GRn_BASE register).</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB2</name>
            <description>Graphics Alpha Blending Control Register 2</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00060010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GRCVS</name>
                <description>Vertical start position of graphics image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x002</minimum>
                    <maximum>0x3EE</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCVS</name>
                    <description>GRCVS lines. The valid range is 0x002 to 0x3EE. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCVW</name>
                <description>Vertical width of graphics image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x010</minimum>
                    <maximum>0x3FC</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCVW</name>
                    <description>GRCVW lines.  The valid range is 0x010 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB3</name>
            <description>Graphics Alpha Blending Control Register 3</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00050010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GRCHS</name>
                <description>Horizontal start position of graphics image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x005</minimum>
                    <maximum>0x3ED</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCHS</name>
                    <description>GRCHS lines. The valid range is 0x005 to 0x3ED. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCHW</name>
                <description>Horizontal width of graphics image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x010</minimum>
                    <maximum>0x3F0</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCHW</name>
                    <description>GRCHW pixels. The valid range is 0x010 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB4</name>
            <description>Graphics Alpha Blending Control Register 4</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00060010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCVS</name>
                <description>Vertical start position of rectangular area alpha blending image area</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x002</minimum>
                    <maximum>0x3EE</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCVS</name>
                    <description>ARCVS linels. The valid range is 0x002 to 0x3EE. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCVW</name>
                <description>Vertical width of rectangular area alpha blending image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x001</minimum>
                    <maximum>0x3FC</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCVW</name>
                    <description>ARCVW linels. The valid range is 0x001 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB5</name>
            <description>Graphics Alpha Blending Control Register 5</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00050010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCHS</name>
                <description>Horizontal start position of rectangular area alpha blending image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x005</minimum>
                    <maximum>0x3ED</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCHS</name>
                    <description>ARCHS pixel. The valid range is 0x005 to 0x3ED. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCHW</name>
                <description>Horizontal width of rectangular area alpha blending image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x001</minimum>
                    <maximum>0x3F8</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCHW</name>
                    <description>ARCHW pixels. The valid range is 0x001 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB6</name>
            <description>Graphics Alpha Blending Control Register 6</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCCOEF</name>
                <description>
									Alpha coefficient for alpha blending in rectangular area (-255 to 255).
									[8]: Sign (0: addition, 1: subtraction)
									[7:0]: Variation (absolute value)
								</description>
                <lsb>16</lsb>
                <msb>24</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>ARCRATE</name>
                <description>Frame rate for alpha blending in rectangular area.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCRATE</name>
                    <description>ARCRATE+1 frames</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB7</name>
            <description>Graphics Alpha Blending Control Register 7</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCDEF</name>
                <description>Initial alpha value for alpha blending in rectangular area.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKON</name>
                <description>RGB-index chroma-key processing control.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables chroma-key processing</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables chroma-key processing</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB8</name>
            <description>Graphics Alpha Blending Control Register 8</description>
            <addressOffset>0x3C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKKG</name>
                <description>
									G signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKKB</name>
                <description>
									B signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKKR</name>
                <description>
									R signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AB9</name>
            <description>Graphics Alpha Blending Control Register 9</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKA</name>
                <description>A value after RGB-index chroma-key processing replacement.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKG</name>
                <description>
									G value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKB</name>
                <description>
									B value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKR</name>
                <description>
									R value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
