OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>BASE</name>
            <description>Graphics Background Color Control Register</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>G</name>
                <description>
									Background color G value
									Unsigned; 8 bits
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>B</name>
                <description>
									Background color B value
									Unsigned; 8 bits
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>R</name>
                <description>
									Background color R value
									Unsigned; 8 bits
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLUTINT</name>
            <description>Graphics CLUT Table Interrupt Control Register</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>CLUT table control</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Uses CLUT1 plane for internal operations.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Uses CLUT0 plane for internal operations.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LINE</name>
                <description>Number of detection lines</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x400</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LINE</name>
                    <description>LINE+1 lines. The valid range is 0x000 to 0x400. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MON</name>
            <description>Graphics Status Monitor Register</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>UNDFLST</name>
                <description>Status monitor for underflow</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>An underflow occurs in internal operations.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No underflow occurs in internal operations.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCST</name>
                <description>Status monitor for alpha blending in rectangular area</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Fade-in/fade-out is in progress.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Fade-in/fade-out is not in progress.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>GAM[%s]</name>
          <description>Gamma Settings</description>
          <addressOffset>0x1300</addressOffset>
          <register>
            <name>LATCH</name>
            <description>Gamma Register Update Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEN</name>
                <description>
									Control of gamma correction x module register value reflection to internal operations.
									The register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GAM_SW</name>
            <description>Gamma Correction Block Function Switch Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GAMON</name>
                <description>Gamma correction on/off control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Turns on gamma correction.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Turns off gamma correction.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x04</dimIncrement>
            <name>LUT[%s]</name>
            <description>Gamma Correction Block Table Setting Register </description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <dim>2</dim>
                <dimIncrement>16</dimIncrement>
                <dimIndex>HIGH,LOW</dimIndex>
                <name>_%s</name>
                <description>
									Gain value of area 0.
									Unsigned 11-bit fixed point.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GAIN00</name>
                    <description>GAIN00/1024</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>5</dim>
            <dimIncrement>0x04</dimIncrement>
            <name>AREA[%s]</name>
            <description>Gamma Correction Block Area Setting Register </description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <dim>3</dim>
                <dimIncrement>10</dimIncrement>
                <dimIndex>HIGH,MID,LOW</dimIndex>
                <name>_%s</name>
                <description>
									Start threshold of area 1
									Unsigned 10-bit integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUT</name>
          <description>Output Control Registers</description>
          <addressOffset>0x13C0</addressOffset>
          <register>
            <name>VLATCH</name>
            <description>Output Control Block Register Update Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEN</name>
                <description>
									Control of output control module register value reflection to internal operations.
									The register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SET</name>
            <description>Output Control Block Output Interface Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENDIANON</name>
                <description>Bit endian change control</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Ascending order (big endian)</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Descending order (little endian)</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWAPON</name>
                <description>Pixel order control</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In the order of BGR</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In the order of RGB</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Output format select</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Serial RGB; select RGB888 as dither output format.</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>RGB565; select RGB565 as dither output format.</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>RGB666; select RGB666 as dither output format.</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>RGB888; select RGB888 as dither output format.</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRQSEL</name>
                <description>Clock frequency division control</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Quarter frequency (serial RGB)</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Setting prohibited</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>No frequency division, parallel RGB</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIRSEL</name>
                <description>Invalid data position control in serial RGB format</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Invalid data is output prior to valid (RGB) data.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Invalid data is output following valid (RGB) data.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PHASE</name>
                <description>Data delay in serial RGB format (based on OUTCLK)</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>3 cycles</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>2 cycles</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1 cycle</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>0 cycle</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BRIGHT1</name>
            <description>Output Control Block Brightness Correction Register 1</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BRTG</name>
                <description>
									Brightness (DC) adjustment of G signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BRIGHT2</name>
            <description>Output Control Block Brightness Correction Register 2</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BRTB</name>
                <description>
									Brightness (DC) adjustment of B signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>16</lsb>
                <msb>25</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>BRTR</name>
                <description>
									Brightness (DC) adjustment of R signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTRAST</name>
            <description>Output Control Block Contrast Correction Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CONTG</name>
                <description>
									Contrast (GAIN) adjustment of G signal
									Unsigned; 8 bits fixed point.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTG</name>
                    <description>CONTG/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONTB</name>
                <description>
									Contrast (GAIN) adjustment of B signal
									Unsigned; 8 bits fixed point
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTB</name>
                    <description>CONTB/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONTR</name>
                <description>
									Contrast (GAIN) adjustment of R signal
									Unsigned; 8 bits fixed point
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTR</name>
                    <description>CONTR/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
