OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>PDTHA</name>
            <description>Output Control Block Panel Dither Correction Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>Operation mode</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>2x2 pattern dither</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Round-off</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Truncate</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORM</name>
                <description>Output format select</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>RGB565; select RGB565 as output interface format.</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>RGB666; select RGB666 as output interface format.</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>RGB888; select RGB888 or serial RGB as output interface format.</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PA</name>
                <description>
									Pattern value (A) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PB</name>
                <description>
									Pattern value (B) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PC</name>
                <description>
									Pattern value (C) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PD</name>
                <description>
									Pattern value (D) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKPHASE</name>
            <description>Output Control Block Output Phase Control Register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FRONTGAM</name>
                <description>Correction control</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Gamma correction is followed by brightness/contrast correction.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Brightness/contrast correction is followed by gamma correction.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LCDEDGE</name>
                <description>LCD_DATA Output Phase Control</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON0EDGE</name>
                <description>LCD_TCON0 Output Phase Control</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON1EDGE</name>
                <description>LCD_TCON1 Output Phase Control</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON2EDGE</name>
                <description>LCD_TCON2 Output Phase Control</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON3EDGE</name>
                <description>LCD_TCON3 Output Phase Control</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TCON</name>
          <description>Timing Control Registers</description>
          <addressOffset>0x1400</addressOffset>
          <register>
            <name>TIM</name>
            <description>TCON Reference Timing Setting Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HALF</name>
                <description>
									Vertical synchronization signal generation change timing
									Sets the delay from the assertion of the internal horizontal synchronization signal in terms of pixels.
								</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HALF</name>
                    <description>HALF pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFSET</name>
                <description>
									Horizontal synchronization signal generation reference timing
									Sets the offset from the assertion of the internal horizontal synchronization signal in terms of pixels.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET</name>
                    <description>OFFSET+1 pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STV%s1</name>
            <description>TCON Vertical Timing Setting Register %s1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VS</name>
                <description>STVx1 first change timing</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x7FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VS</name>
                    <description>VS pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VW</name>
                <description>
									STVx1 second change timing
									Sets the signal assertion width.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x7FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VW</name>
                    <description>VW pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STV%s2</name>
            <description>TCON Vertical Timing Setting Register %s2</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INV</name>
                <description>STVx signal polarity inversion control </description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Inverted</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not inverted</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEL</name>
                <description>Output signal select control for VSOUT (controlled by TCON_STVA2 register)/VEOUT (controlled by the TCON_STVB2 register) pin</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>DE</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>Setting prohibited</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>Setting prohibited</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>Setting prohibited</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>STHB</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>STHA</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>STVB</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>STVA</description>
                    <value>#000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STH%s1</name>
            <description>TCON Horizontal Timing Setting Register STH%s1</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HS</name>
                <description>STHx1 first change timing</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HS</name>
                    <description>HS lines. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HW</name>
                <description>
									STHx1 second change timing.
									Sets the signal assertion width.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HW</name>
                    <description>HW pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STH%s2</name>
            <description>TCON Horizontal Timing Setting Register STH%s2</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSSEL</name>
                <description>STHx signal generation reference timing control.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Reference timing is the offset set with the TCON_TIM.OFFSET[10:0] (horizontal synchronization generation reference timing) field</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Reference timing is the input horizontal synchronization signal (HSIN)</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INV</name>
                <description>STVx signal polarity inversion control.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Inverted</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not inverted</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEL</name>
                <description>Output signal select control for LCD_TCON2 (controlled by TCON_STHA2 register)/LCD_TCON3 (controlled by the TCON_STHB2 register) pin.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>DE</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>Setting prohibited</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>Setting prohibited</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>Setting prohibited</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>STHB</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>STHA</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>STVB</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>STVA</description>
                    <value>#000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
