OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>GTUPSR</name>
          <description>General PWM Timer Up Count Source Select Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>USELC%s</name>
              <description>ELC_GPT Event Source Counter Count Up Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the ELC_GPT input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the ELC_GPT input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Count Up Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Count Up Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Count Up Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Count Up Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Count Up Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Count Up Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Count Up Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Count Up Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>USGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source Counter Count Up Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>USGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source Counter Count Up Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count up is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count up is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTDNSR</name>
          <description>General PWM Timer Down Count Source Select Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>DSELC%s</name>
              <description>ELC_GPT Event Source Counter Count Down Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the ELC_GPT input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the ELC_GPT input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Count Down Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Count Down Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Count Down Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Count Down Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Count Down Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Count Down Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Count Down Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Count Down Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>DSGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source Counter Count Down Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>DSGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source Counter Count Down Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter count down is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter count down is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
