OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_JPEG</name>
      <description>JPEG Codec</description>
      <baseAddress>0x400E6000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000003</offset>
        <size>0x00F</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000058</offset>
        <size>0x01C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000008C</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000100</offset>
        <size>0x11C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000220</offset>
        <size>0x0B2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000300</offset>
        <size>0x01C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000320</offset>
        <size>0x0B2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>JCMOD</name>
          <description> JPEG Code Mode Register</description>
          <addressOffset>0x000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DSP</name>
              <description>Compression/Decompression Set Note: When changing between processing for compression and for decompression, be sure to reset this module in advance by setting the JCUSRST bit in the software reset control register 2 (SWRSTCR2) of the power-downmodes.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Compression process </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Decompression process</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REDU</name>
              <description>Pixel FormatNOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>001</name>
                  <description>YCbCr422(Compression) / YCbCr422(Decompression)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000</name>
                  <description>Setting prohibited(Compression) / YCbCr444(Decompression)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Setting prohibited(Compression) / YCbCr411/[Decompression] </description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Setting prohibited(Compression) / YCbCr420/[Decompression] </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited(Compression) / Error (this module cannot process normally.)(Decompression])</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JCCMD</name>
          <description>JPEG Code Command Register</description>
          <addressOffset>0x001</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <fields>
            <field>
              <name>BRST</name>
              <description>Bus Reset. NOTE: When this module is in operation, the bus reset command should not be issued.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Resets the JCDTCU, JCDTCM, JCDTCD, JCDERR and JCRST registers.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEND</name>
              <description>Interrupt Request Clear Command This bit is valid only for the interrupt sources corresponding to bits INS6, INS5, and INS3 in JINTS0. To clear an interrupt request, set this bit to 1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clear all bits in JINTE0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JRST</name>
              <description>JPEG Core Process Stop Clear CommandTo clear the process-stopped state caused by requests to read the image size and pixel format (enabled by the INT3 bit in JINTE0), set this bit to 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clear the process-stopped state caused by requests to read the image size and pixel format(enabled by the INT3 bit in JINTE0).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSRT</name>
              <description>JPEG Core Process Start CommandTo start JPEG core processing, set this bit to 1. Do not write this bit to 1 again while this module is in operation.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Start JPEG core processing</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JCQTN</name>
          <description>JPEG Code Quantization Table Number Register</description>
          <addressOffset>0x003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>QT3</name>
              <description>Quantization table number for the third color component NOTE: Read-only in Decompression.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Use quantization table No.0 (JCQTBL0) as the third color component.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Use quantization table No.1 (JCQTBL1) as the third color component.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Use quantization table No.2 (JCQTBL2) as the third color component.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Use quantization table No.3 (JCQTBL3) as the third color component.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QT2</name>
              <description>Quantization table number for the second color component NOTE: Read-only in Decompression.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Use quantization table No.0 (JCQTBL0) as the second color component.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Use quantization table No.1 (JCQTBL1) as the second color component.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Use quantization table No.2 (JCQTBL2) as the second color component.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Use quantization table No.3 (JCQTBL3) as the second color component.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QT1</name>
              <description>Quantization table number for the first color componentNOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Use quantization table No.0 (JCQTBL0) as the first color component.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Use quantization table No.1 (JCQTBL1) as the first color component.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Use quantization table No.2 (JCQTBL2) as the first color component.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Use quantization table No.3 (JCQTBL3) as the first color component.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JCHTN</name>
          <description>JPEG Code Huffman Table Number Register</description>
          <addressOffset>0x004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HTA3</name>
              <description>Huffman table number (AC) for the third color componentNOTE: Read-only in Decompression.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AC Huffman table 0(HTD3=0)/Setting prohibited(HTD3=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AC Huffman table 1(HTD3=1)/Setting prohibited(HTD3=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTD3</name>
              <description>Huffman table number (DC) for the third color component NOTE: Read-only in Decompression.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DC Huffman table 0(HTA3=0)/Setting prohibited(HTA3=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DC Huffman table 1(HTA3=1)/Setting prohibited(HTA3=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTA2</name>
              <description>Huffman table number (AC) for the second color componentNOTE: Read-only in Decompression.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AC Huffman table 0(HTD2=0)/Setting prohibited(HTD2=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AC Huffman table 1(HTD2=1)/Setting prohibited(HTD2=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTD2</name>
              <description>Huffman table number (DC) for the second color component NOTE: Read-only in Decompression.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DC Huffman table 0(HTA2=0)/Setting prohibited(HTA2=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DC Huffman table 1(HTA2=1)/Setting prohibited(HTA2=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTA1</name>
              <description>Huffman table number (AC) for the first color componentNOTE: Read-only in Decompression.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AC Huffman table 0(HTD1=0)/Setting prohibited(HTD1=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AC Huffman table 1(HTD1=1)/Setting prohibited(HTD1=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTD1</name>
              <description>Huffman table number (DC) for the first color component NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DC Huffman table 0(HTA1=0)/Setting prohibited(HTA1=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DC Huffman table 1(HTA1=1)/Setting prohibited(HTA1=0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JCDRIU</name>
          <description>JPEG Code DRI Upper Register</description>
          <addressOffset>0x005</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DRIU</name>
              <description>Upper Bytes of MCUs Preceding RST MarkerWhen both upper and lower bytes are set to 00h, neither a DRI nor an RST marker is placed.NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCDRID</name>
          <description>JPEG Code DRI Lower Register</description>
          <addressOffset>0x006</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DRID</name>
              <description>Lower Bytes of MCUs Preceding RST MarkerWhen both upper and lower bytes are set to 00h, neither a DRI nor an RST marker is placed.NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCVSZU</name>
          <description>JPEG Code Vertical Size Upper Register</description>
          <addressOffset>0x007</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VSZU</name>
              <description>Upper Bytes of Vertical Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCVSZD</name>
          <description>JPEG Code Vertical Size Lower Register</description>
          <addressOffset>0x008</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VSZD</name>
              <description>Lower Bytes of Vertical Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCHSZU</name>
          <description>JPEG Code Horizontal Size Upper Register </description>
          <addressOffset>0x009</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HSZU</name>
              <description>Upper Bytes of Horizontal Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCHSZD</name>
          <description>JPEG Coded Horizontal Size Lower Register</description>
          <addressOffset>0x00A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HSZD</name>
              <description>Lower Bytes of Horizontal Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCDTCU</name>
          <description>JPEG Code Data Count Upper Register</description>
          <addressOffset>0x00B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DCU</name>
              <description>Upper bytes of the counted amount of data to be compressed The values of this register are reset before compression starts.NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JCDTCM</name>
          <description>JPEG Code Data Count Middle Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DCM</name>
              <description>Middle bytes of the counted amount of data to be compressedThe values of this register are reset before compression starts. NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
