OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      <addressBlock>
        <offset>0x00000A54</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A60</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A64</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A70</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A74</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A80</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A84</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A90</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000A94</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AA0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AA4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AB0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AB4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AC0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AC4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AD0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AD4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AE0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AE4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AF0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000AF4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B00</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B04</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B10</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B14</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B20</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B24</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B30</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B34</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B40</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B44</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B50</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B54</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B60</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B64</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B70</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B74</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B80</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B84</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B90</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000B94</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BA0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BA4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BB0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BB4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BC0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BC4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BD0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BD4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BE0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BE4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BF0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000BF4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x400</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>A</name>
              <description>A</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>B</name>
              <description>B</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>C</name>
              <description>C</description>
              <value>2</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>MMPU[%s]</name>
          <description>Bus Master MPU Registers</description>
          <addressOffset>0x0000</addressOffset>
          <register>
            <name>CTL</name>
            <description>Bus Master MPU Control Register</description>
            <addressOffset>0x000</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>Write Keyword The data written to these bits are not stored.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0xA5</name>
                    <description>Writing to the OAD and ENABLE bit is valid, when the KEY bits are written 0xA5.</description>
                    <value>0xA5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Writing to the OAD and ENABLE bit is invalid.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OAD</name>
                <description>Operation after detection</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Non-maskable interrupt.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Internal reset.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Master Group enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Master Group is disabled. Permission of all regions.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Master Group is enabled. Protection of all regions.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PT</name>
            <description>Protection of Register</description>
            <addressOffset>0x102</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>Write Keyword The data written to these bits are not stored.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0xA5</name>
                    <description>Writing to the PROTECT bit is valid, when the KEY bits are written 0xA5.</description>
                    <value>0xA5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Writing to the PROTECT bit is invalid.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PROTECT</name>
                <description>Protection of region register</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>All Bus Master MPU register writing is possible.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>All Bus Master MPU register writing is protected. Read is possible.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>32</dim>
            <dimIncrement>0x10</dimIncrement>
            <name>REGION[%s]</name>
            <description>Address Region registers</description>
            <addressOffset>0x0200</addressOffset>
            <register>
              <name>C</name>
              <description>Access Control Register</description>
              <addressOffset>0x00</addressOffset>
              <size>16</size>
              <access>read-write</access>
              <resetValue>0x0000</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>WP</name>
                  <description>Write protection</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>0</name>
                      <description>Write permission</description>
                      <value>#0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1</name>
                      <description>Write protection</description>
                      <value>#1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RP</name>
                  <description>Read protection</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>0</name>
                      <description>Read permission</description>
                      <value>#0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1</name>
                      <description>Read protection</description>
                      <value>#1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ENABLE</name>
                  <description>Region enable</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>0</name>
                      <description>Group m Region n unit is disabled</description>
                      <value>#0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1</name>
                      <description>Group m Region n unit is enabled</description>
                      <value>#1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>S</name>
              <description>Start Address Register</description>
              <addressOffset>0x04</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MMPUSmn</name>
                  <description>Address where the region starts, for use in region determination.NOTE: The low-order 2 bits are fixed to 0.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>E</name>
              <description>End Address Register</description>
              <addressOffset>0x08</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000003</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MMPUEmn</name>
                  <description>Region end address registerAddress where the region end, for use in region determination.NOTE: The low-order 2 bits are fixed to 1.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
