OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>CF1CR</name>
          <description>Control Field 1 Compare Enable Register</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>CF1CE0</name>
              <description>Control Field 1 Bit 0 Compare Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 0 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 0 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE1</name>
              <description>Control Field 1 Bit 1 Compare Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 1 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 1 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE2</name>
              <description>Control Field 1 Bit 2 Compare Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 2 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 2 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE3</name>
              <description>Control Field 1 Bit 3 Compare Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 3 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 3 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE4</name>
              <description>Control Field 1 Bit 4 Compare Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 4 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 4 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE5</name>
              <description>Control Field 1 Bit 5 Compare Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 5 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 5 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE6</name>
              <description>Control Field 1 Bit 6 Compare Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 6 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 6 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CF1CE7</name>
              <description>Control Field 1 Bit 7 Compare Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison with bit 7 of Control Field 1 is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison with bit 7 of Control Field 1 is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CF1RR</name>
          <description>Control Field 1 Receive Data Register</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>TCR</name>
          <description>Timer Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>TCST</name>
              <description>Timer Count Start</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops the timer counting</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts the timer counting</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR</name>
          <description>Timer Mode Register</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>TOMS</name>
              <description>Timer Operating Mode Select</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Timer mode</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Break Field low width determination mode</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Break Field low width output mode</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWRC</name>
              <description>Counter Write Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data is written to the reload register and counter</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data is written to the reload register only</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCSS</name>
              <description>Timer Count Clock Source Select</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>PCLK</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>PCLK/2</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>PCLK/4</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>PCLK/8</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>PCLK/16</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>PCLK/32</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>PCLK/64</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>PCLK/128</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPRE</name>
          <description>Timer Prescaler Register</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xff</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>TCNT</name>
          <description>Timer Count Register</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xff</resetValue>
          <resetMask>0xff</resetMask>
        </register>
