OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI1</name>
      <baseAddress>0x40070020</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI2</name>
      <baseAddress>0x40070040</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI3</name>
      <baseAddress>0x40070060</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI4</name>
      <baseAddress>0x40070080</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI5</name>
      <baseAddress>0x400700A0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI6</name>
      <baseAddress>0x400700C0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI7</name>
      <baseAddress>0x400700E0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI8</name>
      <baseAddress>0x40070100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_SCI0">
      <name>R_SCI9</name>
      <baseAddress>0x40070120</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_SDADC0</name>
      <description/>
      <baseAddress>0x4009C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x019</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000024</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000030</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000034</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000003C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STC1</name>
          <description>Startup Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetMask>0XFFFF</resetMask>
          <fields>
            <field>
              <name>VSBIAS</name>
              <description>Reference voltage select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>0.8V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>1.0V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>1.2V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>1.4V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>1.6V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>1.8V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>2.0V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>2.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>2.4V(only available when VREFSEL=0)</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>SDADC24 Reference Clock Division</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>No Division</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>SDADCCLK/2</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>SDADCCLK/3</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>SDADCCLK/4</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>SDADCCLK/5</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>SDADCCLK/6</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>SDADCCLK/8</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>SDADCCLK/12</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>SDADCCLK/16</description>
                  <value>#1000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADLPM</name>
              <description>A/D conversion operation model select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal A/D conversion mode, SDADC Reference Clock: 4 MHz, Oversampingly clock: 1MHz</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFSEL</name>
              <description>VREF mode select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal VREF Mode</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STC2</name>
          <description>Startup Control Register 2</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BGRPON</name>
              <description>BGR part power control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turn off power to ADBGR, SBIAS, VREFI, and ADREG</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turn onpower to ADBGR, SBIAS, VREFI, and ADREG</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADFPWDS</name>
              <description>ADC reference supply part</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Power of ADREG controlled by BGRPON register</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Power of ADREG is off regardless of BGRPON setting</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPON</name>
              <description>ADREG forced power-down</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turn off power to VBIAS, PGA and sigma-delta A/D converter</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turn on power to VBIAS, PGA and sigma-delta A/D converter</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
