OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>RSTSR0</name>
          <description>Reset Status Register 0</description>
          <addressOffset>0x410</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x70</resetMask>
          <fields>
            <field>
              <name>DPSRSTF</name>
              <description>Deep Software Standby Reset FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Deep software standby mode cancelation not requested by an interrupt. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Deep software standby mode cancelation requested by an interrupt. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD2RF</name>
              <description>Voltage Monitor 2 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage Monitor 2 reset not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage Monitor 2 reset detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD1RF</name>
              <description>Voltage Monitor 1 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage Monitor 1 reset not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage Monitor 1 reset detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD0RF</name>
              <description>Voltage Monitor 0 Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage Monitor 0 reset not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage Monitor 0 reset detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORF</name>
              <description>Power-On Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Power-on reset not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Power-on reset detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTSR2</name>
          <description>Reset Status Register 2</description>
          <addressOffset>0x411</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFE</resetMask>
          <fields>
            <field>
              <name>CWSF</name>
              <description>Cold/Warm Start Determination Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cold start</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Warm start</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVCMPCR</name>
          <description>Voltage Monitor Circuit Control Register</description>
          <addressOffset>0x417</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LVD2E</name>
              <description>Voltage Detection 2 Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage detection 2 circuit disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage detection 2 circuit enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD1E</name>
              <description>Voltage Detection 1 Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage detection 1 circuit disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage detection 1 circuit enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
            <name>LVD1CMPCR</name>
            <description>Voltage Monitoring 1 Comparator Control Register</description>
            <addressOffset>0x417</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x13</resetValue>
            <resetMask>0xff</resetMask>
            <fields>
                <field>
                    <name>LVD1LVL</name>
                    <description>Voltage Detection 1 Level Select (Standard voltage during drop in voltage)</description>
                    <lsb>0</lsb>
                    <msb>4</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0x11</name>
                            <description>2.99 V (Vdet1_11)</description>
                            <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>0x12</name>
                            <description>2.92 V (Vdet1_12)</description>
                            <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>0x13</name>
                            <description>2.85 V (Vdet1_13)</description>
                            <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>Others</name>
                            <description>Setting prohibited</description>
                            <isDefault>true</isDefault>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
                <field>
                    <name>LVD1E</name>
                    <description>Voltage Detection 1 Enable</description>
                    <lsb>7</lsb>
                    <msb>7</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0</name>
                            <description>Voltage detection 1 circuit disabled</description>
                            <value>#0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>1</name>
                            <description>Voltage detection 1 circuit enabled</description>
                            <value>#1</value>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
            </fields>
        </register>
        <register>
          <name>LVDLVLR</name>
          <description>Voltage Detection Level Select Register</description>
          <addressOffset>0x418</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF3</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LVD2LVL</name>
              <description>Voltage Detection 2 Level Select (Standard voltage during fall in voltage)</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>101</name>
                  <description>2.99V (Vdet2_1)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>2.92V (Vdet2_2)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>2.85V (Vdet2_3)</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings other than above are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVD1LVL</name>
              <description>Voltage Detection 1 Level Select (Standard voltage during fall in voltage)</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10001</name>
                  <description>2.99V  (Vdet1_1)</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>2.92V (Vdet1_2)</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>2.85V  (Vdet1_3)</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings other than above are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
            <name>LVD2CMPCR</name>
            <description>Voltage Monitoring 2 Comparator Control Register</description>
            <addressOffset>0x418</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x07</resetValue>
            <resetMask>0xff</resetMask>
            <fields>
                <field>
                    <name>LVD2LVL</name>
                    <description>Voltage Detection 2 Level Select (Standard voltage during drop in voltage)</description>
                    <lsb>0</lsb>
                    <msb>2</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>101</name>
                            <description>2.99 V (Vdet2_5)</description>
                            <value>#101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>110</name>
                            <description>2.92 V (Vdet2_6)</description>
                            <value>#110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>111</name>
                            <description>2.85 V (Vdet2_7)</description>
                            <value>#111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>Others</name>
                            <description>Setting prohibited</description>
                            <isDefault>true</isDefault>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
                <field>
                    <name>LVD2E</name>
                    <description>Voltage Detection 2 Enable</description>
                    <lsb>7</lsb>
                    <msb>7</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0</name>
                            <description>Voltage detection 2 circuit disabled</description>
                            <value>#0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>1</name>
                            <description>Voltage detection 2 circuit enabled</description>
                            <value>#1</value>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
            </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>1,2</dimIndex>
          <name>LVD%sCR0</name>
          <description>Voltage Monitor %s Circuit Control Register 0</description>
          <addressOffset>0x41A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x8A</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>RN</name>
              <description>Voltage Monitor Reset Negate Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Negation follows a stabilization time (tLVD) after VCC &gt; Vdet is detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Negation follows a stabilization time (tLVD) after assertion of the LVD reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RI</name>
              <description>Voltage Monitor Circuit Mode Select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Voltage Monitor  interrupt during Vdet1 passage</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Voltage Monitor  reset enabled when the voltage falls to and below Vdet1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSAMP</name>
              <description>Sampling Clock Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>1/2 LOCO frequency</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>1/4 LOCO frequency</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1/8 LOCO frequency</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1/16 LOCO frequency</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPE</name>
              <description>Voltage Monitor Circuit Comparison Result Output Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable voltage monitor 1 circuit comparison result output</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable voltage monitor 1 circuit comparison result output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDIS</name>
              <description>Voltage Monitor Digital Filter Disable Mode Select</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enable digital filter</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable digital filter</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIE</name>
              <description>Voltage Monitor Interrupt/Reset Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VBTCR1</name>
          <description>VBATT Control Register1</description>
          <addressOffset>0x41F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BPWSWSTP</name>
              <description>Battery Power supply Switch Stop</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Battery Power supply Switch Enable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Battery Power supply Switch stop</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
