OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_TZF</name>
      <description>TrustZone Filter</description>
      <baseAddress>0x40000E00</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x04</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x180</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TZFOAD</name>
          <description>TrustZone Filter Operation After Detection Register </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>OAD</name>
              <description>Operation after detection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reset</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-maskable interrupt</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>KeyCode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZFPT</name>
          <description>TrustZone Filter Protect Register</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>Protection of register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>All Bus TrustZone Filter register writing is protected. Read is possible.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>All Bus TrustZone Filter register writing is possible.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>KeyCode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZFSAR</name>
          <description>TrustZone Filter Security Attribution Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>TZFSA0</name>
              <description>Security attributes of registers for TrustZone Filter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-secure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_CACHE</name>
      <description>R_CACHE</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
          <offset>0x00</offset>
          <size>12</size>
          <usage>registers</usage>
      </addressBlock>
      <addressBlock>
          <offset>0x40</offset>
          <size>12</size>
          <usage>registers</usage>
      </addressBlock>
      <addressBlock>
          <offset>0x200</offset>
          <size>8</size>
          <usage>registers</usage>
      </addressBlock>
      <registers>
          <register>
              <name>CCACTL</name>
              <description>C-Cache Control Register</description>
              <addressOffset>0x000</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>ENC</name>
                      <description>C-Cache Enable</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>Disable C-cache</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>Enable C-cache</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>CCAFCT</name>
              <description>C-Cache Flush Control Register</description>
              <addressOffset>0x004</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>FC</name>
                      <description>C-Cache Flush</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>No action</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>C-cache line flush (all lines invalidated)</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>CCALCF</name>
              <description>C-Cache Line Configuration Register</description>
              <addressOffset>0x008</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000101</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>CC</name>
                      <description>C-Cache Line Size</description>
                      <lsb>0</lsb>
                      <msb>1</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>00</name>
                              <description>Prohibited</description>
                              <value>#00</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>01</name>
                              <description>Cache line size 32 bytes</description>
                              <value>#01</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>10</name>
                              <description>Cache line size 64 bytes</description>
                              <value>#10</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>11</name>
                              <description>Prohibited</description>
                              <value>#11</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>SCACTL</name>
              <description>S-Cache Control Register</description>
              <addressOffset>0x040</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>ENS</name>
                      <description>S-Cache Enable</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>Disable S-cache</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>Enable S-cache</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>SCAFCT</name>
              <description>S-Cache Flush Control Register</description>
              <addressOffset>0x044</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>FS</name>
                      <description>S-Cache Flush</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>No action</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>S-cache line flush (all lines invalidated)</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>SCALCF</name>
              <description>S-Cache Line Configuration Register</description>
              <addressOffset>0x048</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000101</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>CS</name>
                      <description>S-Cache Line Size</description>
                      <lsb>0</lsb>
                      <msb>1</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>00</name>
                              <description>Prohibited</description>
                              <value>#00</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>01</name>
                              <description>Cache line size 32 bytes</description>
                              <value>#01</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>10</name>
                              <description>Cache line size 64 bytes</description>
                              <value>#10</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>11</name>
                              <description>Prohibited</description>
                              <value>#11</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>CAPOAD</name>
              <description>Cache Parity Error Operation After Detection Register</description>
              <addressOffset>0x200</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>OAD</name>
                      <description>Operation after Detection</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>Non-maskable interrupt</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>Reset</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
              </fields>
          </register>
          <register>
              <name>CAPRCR</name>
              <description>Cache Protection Register</description>
              <addressOffset>0x204</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xffffffff</resetMask>
              <fields>
                  <field>
                      <name>PRCR</name>
                      <description>Register Write Control</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <access>read-write</access>
                      <enumeratedValues>
                          <enumeratedValue>
                              <name>0</name>
                              <description>Disable writes to protected registers</description>
                              <value>#0</value>
                          </enumeratedValue>
                          <enumeratedValue>
                              <name>1</name>
                              <description>Enable writes to protected registers</description>
                              <value>#1</value>
                          </enumeratedValue>
                      </enumeratedValues>
                  </field>
                  <field>
                      <name>KW</name>
                      <description>Write key code</description>
                      <lsb>1</lsb>
                      <msb>7</msb>
                      <access>read-write</access>
                  </field>
              </fields>
          </register>
