OpenAtomFoundation/TobudOS/board/Renesas_ra6m4/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_CPSCU</name>
      <description>CPU System Security Control Unit</description>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x12</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x0C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x130</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1B0</offset>
        <size>4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
            <name>CSAR</name>
            <description>Cache Security Attribution Register</description>
            <addressOffset>0x000</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xffffffff</resetValue>
            <resetMask>0xffffffff</resetMask>
            <fields>
                <field>
                    <name>CACHESA</name>
                    <description>Security Attributes of Registers for Cache Control</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0</name>
                            <description>Secure</description>
                            <value>#0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>1</name>
                            <description>Non-secure</description>
                            <value>#1</value>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
                <field>
                    <name>CACHELSA</name>
                    <description>Security Attributes of Registers for Cache Line Configuration</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0</name>
                            <description>Secure</description>
                            <value>#0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>1</name>
                            <description>Non-secure</description>
                            <value>#1</value>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
                <field>
                    <name>CACHEESA</name>
                    <description>Security Attributes of Registers for Cache Error</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <access>read-write</access>
                    <enumeratedValues>
                        <enumeratedValue>
                            <name>0</name>
                            <description>Secure</description>
                            <value>#0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                            <name>1</name>
                            <description>Non-secure</description>
                            <value>#1</value>
                        </enumeratedValue>
                    </enumeratedValues>
                </field>
            </fields>
        </register>
        <register>
          <name>SRAMSAR</name>
          <description>SRAM Security Attribution Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>SRAMSA0</name>
              <description>Security attributes of registers for SRAM Protection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>Nonsecure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSA1</name>
              <description>Security attributes of registers for SRAM Protection 2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>Nonsecure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSA2</name>
              <description>Security attributes of registers for ECC Relation</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>Nonsecure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STBRAMSAR</name>
          <description>Standby RAM memory Security Attribution Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xfffffff0</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>NSBSTBR</name>
              <description>Security attributes of each region for Standby RAM</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Region7-0 are all Secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>Region7 is Non-secure. Region6-0 are Secure</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>Region7-6 are Non-secure. Region5-0 are Secure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3</name>
                  <description>Region7-5 are Non-secure. Region4-0 are Secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x4</name>
                  <description>Region7-4 are Non-secure. Region 3-0 are Secure.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x5</name>
                  <description>Region7-3 are Non-secure. Region 2-0 are Secure.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x6</name>
                  <description>Region7-2 are Non-secure. Region 1-0 are Secure.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x7</name>
                  <description>Region7-1 are Non-Secure. Region0 is Secure.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Others</name>
                  <description>Region7-0 are all Non-Secure.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCSAR</name>
          <description>DTC Controller Security Attribution Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DTCSTSA</name>
              <description>DTC Security Attribution</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-Secure.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACSAR</name>
          <description>DMAC Controller Security Attribution Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DMASTSA</name>
              <description>DMAST Security Attribution</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-secure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARA</name>
          <description>ICU Security Attribution Register A</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAIRQCRn</name>
              <description>Security Attributes of registers for the IRQCRn registers</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARB</name>
          <description>ICU Security Attribution Register B</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SANMI</name>
              <description>Security Attributes of nonmaskable interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARC</name>
          <description>ICU Security Attribution Register C</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADMACn</name>
              <description>Security Attributes of registers for DMAC channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARD</name>
          <description>ICU Security Attribution Register D</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SASELSR0</name>
              <description>Security Attributes of registers for SELSR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARE</name>
          <description>ICU Security Attribution Register E</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAIWDTWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SALVD1WUP</name>
              <description>Security Attributes of registers for WUPEN0.b 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SALVD2WUP</name>
              <description>Security Attributes of registers for WUPEN0.b 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SARTCALMWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SARTCPRDWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAUSBFS0WUP</name>
              <description>Security Attributes of registers for WUPEN0.b 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAAGT1UDWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAAGT1CAWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAAGT1CBWUP</name>
              <description>Security Attributes of registers for WUPEN0.b 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAIIC0WUP</name>
              <description>Security Attributes of registers for WUPEN0.b 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARF</name>
          <description>ICU Security Attribution Register F</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAAGT3UDWUP</name>
              <description>Security Attributes of registers for WUPEN1.b 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAAGT3CAWUP</name>
              <description>Security Attributes of registers for WUPEN1.b 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SAAGT3CBWUP</name>
              <description>Security Attributes of registers for WUPEN1.b 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARG</name>
          <description>ICU Security Attribution Register G</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAIELSRn</name>
              <description>Security Attributes of registers for IELSR31 to IELSR0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARH</name>
          <description>ICU Security Attribution Register H</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAIELSRn</name>
              <description>Security Attributes of registers for IELSR63 to IELSR32</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICUSARI</name>
          <description>ICU Security Attribution Register I</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAIELSRn</name>
              <description>Security Attributes of registers for IELSR95 to IELSR64</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSSARA</name>
          <description>Bus Security Attribution Register A</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>BUSSA0</name>
              <description>BUS Security Attribution A0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-Secure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSSARB</name>
          <description>Bus Security Attribution Register B</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>BUSSB0</name>
              <description>BUS Security Attribution B0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-Secure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMPUSARA</name>
          <description>Master Memory Protection Unit Security Attribution Register A</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MMPUAnSA</name>
              <description>MMPUAn Security Attribution (n = 0 to 7)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Secure</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-Secure</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
